//변수
//어떤 정보에 이름을 붙여서 저장하고 싶을 때

//경고창을 띄우는 함수 alert()
//로그를 찍는 함수 console.log()

//name = "mike";
//age=30;
//이렇게 선언하는건 굉장히 위험함
//다른 개발자가 같은 변수명을 사용할 수 있기 때문
//그럴때 사용하는것이 let과 const

let name = "mike";

//let을 수정하고 싶을땐 let을 생략하고 name= "google";이런식으로 적어주면 됨

//const 
//절대로 바뀌지 않는 상수 (수정x)
//대문자로 선언하는게 좋음

//자바스크립트에서 변수를 선언할때는 변하지 않는 값은 const, 변할 수 있는 값은 let으로 선언하세요
//모든 변수를 const로 선언하고 변경될 가능성이 있는 변수를 let으로 선언.

//1.변수는 문자와 숫자, $와_만 사용
//2.첫글자는 숫자가 될 수 없다.
//3.예약어는 사용할 수 없다.
//4.가급적 상수는 대문자로 알려줘야함
//5.변수명은 읽기 쉽고 이해할 수 있게 선언해야함


